In [1]:
import pandas as pd

# DF using Dictionary

In [12]:
myname1={'a':["vimal",1111],'b':["apple",2222],'c':["mango",3333]}

In [14]:
mydf1=pd.DataFrame(data=myname1)

In [15]:
print(mydf1)

       a      b      c
0  vimal  apple  mango
1   1111   2222   3333

# DF using List

In [3]:
myname=[["vimal",1111],["apple",2222],["mango",3333]]

In [8]:
mydf=pd.DataFrame(data=myname,columns=["name","number"])

In [9]:
print(mydf)

    name  number
0  vimal    1111
1  apple    2222
2  mango    3333

# Exploring DF

In [10]:
mydf['name']

0    vimal
1    apple
2    mango
Name: name, dtype: object

In [11]:
mydf.loc[0]

name      vimal
number     1111
Name: 0, dtype: object

In [13]:
mydf.iloc[0]

name      vimal
number     1111
Name: 0, dtype: object

In [16]:
mydf.iloc[1:]

    name  number
1  apple    2222
2  mango    3333

In [17]:
mydf.iloc[1: ,1]

1    2222
2    3333
Name: number, dtype: int64

#### Find Difference between loc and iloc

# Reading and operating on csv

In [20]:
import pandas as pd

In [21]:
dataset=pd.read_csv("marks.csv")

In [22]:
dataset

   hours  marks
0      3     30
1      5     50
2      7     70
3      1     10

In [26]:
marks=dataset.iloc[:,1]

In [27]:
hours=dataset.iloc[:,0]